{
  "RGBColors": "RGBLight package",
  "RGBLight": "RGBLight Functions",
  "RGBLight.LHRGBLight": "A RGBLight class",
  "RGBPixelMode": "Different modes for RGB or RGB+W RGBLight LHRGBLight",
  "microbot.Ultrasonic": "Obtain the distance of ultrasonic detection to the obstacle",
  "microbot.adjustBlack": "Color sensor black calibration, each time you turn on the first use of the color sensor the white must be adjusted at first then adjust black.",
  "microbot.adjustWhite": "Color sensor white calibration, each time you turn on the first use of the color sensor the white must be corrected at first.",
  "microbot.analyzeBluetoothCmd": "Resolve the Bluetooth that phone APP send command type, the total of nine types of commands: tank display command, servo debug command, obtaining the distance of ultrasonic command, obtaining temperature command, obtain sound size rank orders, to obtain the light level command, set the color lights command, honking command, firmware version information command.",
  "microbot.checkCurrentColor": "Color sensor to obtain color value, white and black must be corrected before execution.",
  "microbot.clearLight": "Clear the color of the colored lights and turn off the lights.",
  "microbot.convertLight": "Convert the light value is the standard command and send it to the mobile phone. The APP displays the current light level (0~255).",
  "microbot.convertTemperature": "The conversion temperature value is standard command, sent to the mobile phone, and the APP displays the current temperature.",
  "microbot.convertUltrasonic": "The distance from the ultrasonic obstacle is the standard command, which is sent to the mobile phone. The APP will indicate the distance of the ultrasonic obstacle.",
  "microbot.getArgs": "Resolve the parameters that the phone APP send the command,there are 3 parameters of servo debug command,the other command has just one parameter.",
  "microbot.getBluetoothCmdtype": "Returns the enumeration of the command type, which can be compared with this module after obtaining the bluetooth command type sent by the mobile phone APP.",
  "microbot.getRunCarTypeget": "The command type of the tank is stop, go ahead, back, turn left, turn right, slow down, turn left slowly, turn right slowly.",
  "microbot.getSoundVolume": "Get the volume level detected by the sound sensor, range 0 to 255",
  "microbot.grapObject": "Robot arm grab something",
  "microbot.grapReady": "Robot arm grab is ready",
  "microbot.initColorSensor": "컬러센서 초기화 Init Color Sensor",
  "microbot.littleStarMelody": "The Melody of Little star",
  "microbot.microbotInit": "보드 microbot board initialization, please execute at boot time",
  "microbot.readLineFollowerStatus": "Obtain the condition of the tracking sensor",
  "microbot.releaseObject": "Robot arm release something",
  "microbot.robotArmDrawString": "Control the robot arm draw string",
  "microbot.setBusServo": "Set the angle of bus servo 1 to 8, range of 0~240 degree",
  "microbot.setMotorSpeed": "Set the speed of the number 1 motor and number 2 motor, range of -100~100, that can control the tank to go advance or turn of.",
  "microbot.setPixelRGB": "Set the color of the colored lights, after finished the setting please perform  the display of colored lights.",
  "microbot.setPixelRGBArgs": "Set RGB Color argument",
  "microbot.setServo": "1번에서 8번 서보 각도 설정Set the angle of servo 1 to 8, range of 0~180 degree",
  "microbot.showLight": "Display the colored lights, and set the color of the colored lights to match the use. After setting the color of the colored lights, the color of the lights must be displayed."
}
